# Задача №2:
# Найдите сумму цифр трехзначного числа.
#
# Проверка:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
#
# Решение:
a = int(input("Введите трехзначное число: "))
print(a)
b = a % 10
# print(b)
c = a // 10 % 10
# print(c)
d = a // 100 % 10
# print(d)
sumNumbers = b + c + d
print(sumNumbers)